HandsOn/Group07/requirements/datasetRequirements.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Dataset Requirements</title>
<!-- 2018-10-03 Wed 19:23 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Luciano García Giordano, José Luis Del Pino García, Jhon Toledo Barreto, Daniel Argota García" />
</head>
<body>
<div id="content">
<h1 class="title">Dataset Requirements</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Discussion of the satisfaction of the proposed requirements</a>
<ul>
<li><a href="#sec-1-1">1.1. R1: Data are in one of the selected smart city domains</a></li>
<li><a href="#sec-1-2">1.2. R2. Data are available as a CSV file</a></li>
<li><a href="#sec-1-3">1.3. R3. Data have an open license so they can be published</a></li>
<li><a href="#sec-1-4">1.4. R4. Data can be easily linked with generic real-world entities (e.g., locations)</a></li>
<li><a href="#sec-1-5">1.5. R5. Documentation exists for the data (optional)</a></li>
<li><a href="#sec-1-6">1.6. R6. Data can come from multiple data sources (optional)</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Conclusion</a></li>
</ul>
</div>
</div>
<p>
Jesús Hormigos Villalba - jesushvillalba
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Discussion of the satisfaction of the proposed requirements</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> R1: Data are in one of the selected smart city domains</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The dataset chosen aggregates air quality data gathered by weather stations in the city of Madrid. This is one of the most prominent topics in the Smart City domain. Furthermore, the chosen topic is of special relevance in the city of Madrid, infamous by the pollution of its air.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> R2. Data are available as a CSV file</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The data can be found as csv in the following Kaggle dataset: <a href="https://www.kaggle.com/decide-soluciones/air-quality-madrid">https://www.kaggle.com/decide-soluciones/air-quality-madrid</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> R3. Data have an open license so they can be published</h3>
<div class="outline-text-3" id="text-1-3">
<p>
According to the official website of the dataset and the adaptation made by the publisher in Kaggle, the dataset has as license the Madrid Open Data Terms of Use. It allows the free usage of the data, without liability, for commercial and non-commercial use-cases. Publishing and republishing the data is also permitted as long as the original source is entitled. For access to the license as a whole, follow the link: <a href="https://datos.madrid.es/portal/site/egob/menuitem.3efdb29b813ad8241e830cc2a8a409a0/?vgnextoid=108804d4aab90410VgnVCM100000171f5a0aRCRD&vgnextchannel=b4c412b9ace9f310VgnVCM100000171f5a0aRCRD&vgnextfmt=default">https://datos.madrid.es/portal/site/egob/menuitem.3efdb29b813ad8241e830cc2a8a409a0/?vgnextoid=108804d4aab90410VgnVCM100000171f5a0aRCRD&vgnextchannel=b4c412b9ace9f310VgnVCM100000171f5a0aRCRD&vgnextfmt=default</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> R4. Data can be easily linked with generic real-world entities (e.g., locations)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
As especially interesting data points, we can extract the locations of the weather stations, as well as the neighbourhoods in which they are located. However, more feasible links are to be studied.
Thus, at least the following entities can be linked to real-world entities:
</p>
<ul class="org-ul">
<li>Weather stations locations (coordinates and streets)
</li>
<li>Weather stations neighbourhoods
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> R5. Documentation exists for the data (optional)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The Kaggle dataset webpage (<a href="https://www.kaggle.com/decide-soluciones/air-quality-madrid/home">https://www.kaggle.com/decide-soluciones/air-quality-madrid/home</a>) documents all the variables available in the dataset.
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> R6. Data can come from multiple data sources (optional)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Other information regarding, for example the neighbourhoods, can be retrieved from other data sources. Thus, R6 is satisfied.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Conclusion</h2>
<div class="outline-text-2" id="text-2">
<p>
As a conclusion, we can confidently state that all the proposed requirements are satisfied.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luciano García Giordano, José Luis Del Pino García, Jhon Toledo Barreto, Daniel Argota García</p>
<p class="date">Created: 2018-10-03 Wed 19:23</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
